scripts/load-test.yml
#### read ####
# test connect or start use phases warm up phase, or use all phases
# finish ingredient, marked ✅ means pass test.
# before start, make sure there are exactly data with the id you want to test.
# can use ./db-testdata.sql to init some data.
# $randomNumber(start, end) can adjust number to test
# update needing all fields and send object with post, worth improvement.
# it will return failure when update or delete data not in db table, which is normal.

config:
  target: "{{$processEnvironment.INGREDIENT_BACKEND_URL}}"
  http:
    timeout: 30
    retries: 2
    logLevel: info
  phases:
    - duration: 20
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 20
      arrivalRate: 5
      rampTo: 20
      name: Ramp up load
    - duration: 20
      arrivalRate: 20
      rampTo: 30
      name: Spike phase
  ensure:
    - maxErrors: 10
    - maxResponseTime: 2000

scenarios:
  - name: "Ingredient CRUD"
    flow:
      - get:
          url: "/ingredient/getAll/{{ $randomNumber(1, 4) }}"
          weight: 5

      - get:
          url: "/ingredient/get/{{ $randomNumber(1, 4) }}"
          weight: 3   

      # add ingredient, medium weight
      # - post:
      #     url: "/ingredient/add"
      #     headers:
      #       Content-Type: "application/json"
      #     json:
      #       userId: "{{ $randomNumber(1, 5) }}"
      #       name: "{{ name }}"
      #       quantity: "{{ $randomNumber(1, 3) }}"
      #       uom: "{{ uom }}"
      #       expiryDate: "{{ expiry_date }}"
      #     weight: 3   
      # ✅

      # update ingredient, low weight
      # - post:
      #     url: "/ingredient/update"
      #     json:
      #       id: "{{ $randomNumber(10, 15) }}"
      #       userId: "{{ $randomNumber(1, 5) }}"
      #       name: "{{ name }}"
      #       quantity: "{{ $randomNumber(1, 3) }}"
      #       uom: "{{ uom }}"
      #       expiryDate: "{{ expiry_date }}"
      #     weight: 2   
      # ✅

      # # delete ingredient, low weight
      # - delete:
      #     url: "/ingredient/delete/{{ $randomNumber(60, 90) }}"
      #     weight: 1   
      # # ✅